<?php

namespace Database\Seeders;

use App\Models\MaterialSubject;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class MaterialSubjectsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            [
                'name' => 'Барлық пәндер',
            ],
            [
                'name' => 'Адам және қоғам',
            ],
            [
                'name' => 'Алғашқы әскери дайындық',
            ],
            [
                'name' => 'Алгебра',
            ],
            [
                'name' => 'Астрономия',
            ],
            [
                'name' => 'Аттестаттау материалдары',
            ],
            [
                'name' => 'Əлеуметтік педагог',
            ],
            [
                'name' => 'Әлеуметтану',
            ],
            [
                'name' => 'Әдістемелік бірлестік жетекшілері',
            ],
            [
                'name' => 'Балабақша',
            ],
            [
                'name' => 'Бастауыш сынып',
            ],
            [
                'name' => 'Биология',
            ],
            [
                'name' => 'География',
            ],
            [
                'name' => 'Геометрия',
            ],
            [
                'name' => 'Директорға',
            ],
            [
                'name' => 'Дене шынықтыру',
            ],
            [
                'name' => 'Дінтану',
            ],
            [
                'name' => 'Жаңартылған бағдарлама',
            ],
            [
                'name' => 'Жаратылыстану',
            ],
            [
                'name' => 'Завучтарға',
            ],
            [
                'name' => 'Информатика',
            ],
            [
                'name' => 'Кітапханашылар',
            ],
            [
                'name' => 'Коррекциялық мектеп',
            ],
            [
                'name' => 'Қазақ тілі',
            ],
            [
                'name' => 'Қазақ әдебиеті',
            ],
            [
                'name' => 'Қаржылық сауаттылық пәні',
            ],
            [
                'name' => 'Құқық негіздері',
            ],
            [
                'name' => 'Қосымша білім беру',
            ],
            [
                'name' => 'Логопед, дефектолог',
            ],
            [
                'name' => 'Математика',
            ],
            [
                'name' => 'Мәдениеттану',
            ],
            [
                'name' => 'Мектепалды даярлық',
            ],
            [
                'name' => 'Музыка',
            ],
            [
                'name' => 'Мектеп әкімшілігі',
            ],
            [
                'name' => 'Мектептен тыс мекемелер',
            ],
            [
                'name' => 'Өзін-өзі тану',
            ],
            [
                'name' => 'Психология',
            ],
            [
                'name' => 'Русский язык',
            ],
            [
                'name' => 'Русская литература',
            ],
            [
                'name' => 'Сынып жетекші',
            ],
            [
                'name' => 'Сызу',
            ],
            [
                'name' => 'Сурет',
            ],
            [
                'name' => 'Дүние жүзі тарихы',
            ],
            [
                'name' => 'Қазақстан тарихы',
            ],
            [
                'name' => 'Оқу ісінің меңгерушісі',
            ],
            [
                'name' => 'Технология',
            ],
            [
                'name' => 'Тіршілік қауіпсіздігінің негіздері',
            ],
            [
                'name' => 'Физика',
            ],
            [
                'name' => 'Философия',
            ],
            [
                'name' => 'Химия',
            ],
            [
                'name' => 'Шағын орталық',
            ],
            [
                'name' => 'Шет тілі',
            ],
            [
                'name' => 'Неміс тілі',
            ],
            [
                'name' => 'Экономика',
            ],
            [
                'name' => 'Экология',
            ],
            [
                'name' => 'Басқа',
            ]
        ];

        foreach($data as $datum) {
            MaterialSubject::create($datum);
        } 
    }
}
