<?php

namespace Database\Seeders;

use App\Models\PersonalAdvice;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class PersonalAdviceSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            [
                'title' => [
                    'ru' => 'Учимся создавать авторскую программу',
                    'kk' => 'Авторлық бағдарлама жасауды үйрену'
                ],
                
                'description' => [
                    'ru' => 'Уважаемый коллега, с глазу на глаз с тренером выберите тему для авторской программы, узнайте, как ее составить и из каких разделов она состоит, как заполнить графы, как передать членам комиссии, какие стандарты должны быть встретились.',
                    'kk' => 'Құрметті әріптес, тренермен бетпе бет отырып авторлық бағдарламаға тақырып таңдап, жасау жолын және қандай бөлімдерден тұрады, бағандарын қалай толтыру керек, коммисия мүшелеріне қалай өткізу керек, қандай стандартқа сай болу керек барлығын үйреніп шығыңыз.'
                ],
                'price' => 8000
            ],
            [
                'title' => [
                    'ru' => 'Педагогическое айкидо',
                    'kk' => 'Педагогикалық айкидо'
                ],
                
                'description' => [
                    'ru' => 'Уважаемый коллега, с глазу на глаз с тренером выберите тему для авторской программы, узнайте, как ее составить и из каких разделов она состоит, как заполнить графы, как передать членам комиссии, какие стандарты должны быть встретились.',
                    'kk' => 'Құрметті әріптес, тренермен бетпе бет отырып авторлық бағдарламаға тақырып таңдап, жасау жолын және қандай бөлімдерден тұрады, бағандарын қалай толтыру керек, коммисия мүшелеріне қалай өткізу керек, қандай стандартқа сай болу керек барлығын үйреніп шығыңыз.'
                ],
                'price' => 10000
            ]
        ];
        foreach($data as $datum) {
            PersonalAdvice::create($datum);
        }
    }
}
