<?php

return [
    'Кіру' => 'Войти',
    'Тіркелу' => 'Регистрация',
    'Жаңалықтар' => 'Новости',
    'Аттестация' => 'Аттестация',
    'Калькулятор' => 'Калькулятор',
    'Жеке кеңес' => 'Консультация',
    'Материалдар' => 'Материалы',
    'Мәзір' => 'Меню',
    'Барлығы' => 'Все новости',
    'Хабарландыру' => 'Уведомлении',
    'Танымал' => 'Популярные',
    'Сақталғандар' => 'Сохраненные',
    'Менің материалдарым' => 'Мои материалы',
    'Профиль' => 'Профиль',
    'Жазылым' => 'Подписка',
];
