<?php

return [
    'Кіру' => 'Кіру',
    'Тіркелу' => 'Тіркелу',
    'Жаңалықтар' => 'Жаңалықтар',
    'Аттестация' => 'Аттестация',
    'Калькулятор' => 'Калькулятор',
    'Жеке кеңес' => 'Жеке кеңес',
    'Материалдар' => 'Материалдар',
    'Мәзір' => 'Мәзір',
    'Барлығы' => 'Барлығы',
    'Хабарландыру' => 'Хабарландыру',
    'Танымал' => 'Танымал',
    'Сақталғандар' => 'Сақталғандар',
    'Менің материалдарым' => 'Менің материалдарым',
    'Профиль' => 'Менің кабинетім',
    'Жазылым' => 'Жазылым',
];
