app/Http/Controllers/Api/V1/AuthController.php

select * from `users` where `phone` = '+0885425054' or `email` = '+0885425054' limit 1
---
    public function login(LoginRequest $request)
    {
        $login = $request->input('login');
        $user = User::where('phone', $login)->orWhere('email', $login)->first();

update `sms_verifications` set `status` = 'verified', `sms_verifications`.`updated_at` = '2022-07-02 14:37:40' where `id` = 6
select `id` from `roles` where `is_general` = 1
insert into `users` (`full_name`, `email`, `phone`, `role_id`, `password`, `updated_at`, `created_at`) values ('John Doe', 'johndoe@mail.ru', '7073999586', 2, '$2y$10$tUwFj5ivSanLf.RUwk5cEuWRL79BHuT97g/hshyQ0.BuCVjyHDUp2', '2022-07-02 14:37:40', '2022-07-02 14:37:40')
---
    public function register(RegisterRequest $request): LoggedInResource
    {
       $smsVerification = $this->checkCode($request->phone, $request->code);

        DB::beginTransaction();
        $smsVerification->status = SmsVerification::STATUS_VERIFIED;
        $smsVerification->save();
        $roleIds = Role::isGeneral()->select('id')->get()->pluck('id')->toArray();
        $roleId = in_array($request->role_id, $roleIds) ? $request->role_id : Role::DEFAULT_ROLE;
        $user = User::forceCreate(
            [
                'full_name' => $request->input('full_name'),
                'email' => $request->input('email'),
                'phone' => $request->input('phone'),
                'role_id' => $roleId,
                // 'role_id' => $request->input('role_id', Role::DEFAULT_ROLE),
                'password' => Hash::make($request->input('password')),
            ]
        );
        DB::commit();
        return new LoggedInResource($this->createTokenService->create($user, config('app.name')));

select * from `users` where `phone` = '7073999586' limit 1
---
    public function resetPasswordSendSmsCode(Request $request)
    {
        $user = User::phoneBy($request->phone)->firstOrFail();

select * from `users` where `phone` = '+0885425054' limit 1
---
    public function resetPassword(ResetPasswordSaveRequest $request)
    {
        $phone = $request->phone;
        $value = Cache::get("password_reset_hash/$phone");

        if($value != $request->hash) {
            throw new ErrorException('Хеш қате');
        }
        $user = User::phoneBy($request->phone)->firstOrFail();

insert into `sms_verifications` (`code`, `status`, `phone`, `updated_at`, `created_at`) values (5054, 'pending', '+0885425054', '2022-07-02 14:11:04', '2022-07-02 14:11:04')
---
    private function sendSms($phone)
    {
//        $code = $phone % 10000;
        $code = $this->smsService->generateCode();

        $msg = __('auth.sms_verification') . $code;

        // $result =
        $this->smsService->send($msg, $phone);

        // $smsVerification =
        SmsVerification::create([
            'code' => $code,
            'status' => SmsVerification::STATUS_PENDING,
            'phone' => $phone
        ]);

select * from `sms_verifications` where `phone` = '+0885425054' and `status` = 'pending' and `code` = '5054' limit 1
---
    private function checkCode($phone, $code)
    {
        $smsVerification = SmsVerification::phoneBy($phone)
            ->statusPending()
            ->where('code', $code)
            ->first();