app/Http/Controllers/Api/V1/AuthController.php

    public function resetPasswordVerifyCode(ResetPasswordVerifyCodeRequest $request)
    {
        $phone = $request->phone;

        $smsVerification = $this->checkCode($request->phone, $request->code);
        DB::beginTransaction();
        $smsVerification->status = SmsVerification::STATUS_VERIFIED;
        $smsVerification->save();
---
insert into `sms_verifications` (`code`, `status`, `phone`, `updated_at`, `created_at`) values (9586, 'pending', '7073999586', '2022-07-02 14:37:13', '2022-07-02 14:37:13')