app/Services/V1/SmsService.php

select count(*) as aggregate from `sms_verifications` where `phone` = '7073999586' and date(`created_at`) >= '2022-07-01'
---
    public function checkLimitSms($phone)
    {
        $limitSmsCount = SmsVerification::phoneBy($phone)
            ->whereDate('created_at', '>=', now()->subMinutes(SmsVerification::LIMIT_SMS_MINUTE))
            ->count();